%% 生成等距数据
clear;clc;
num=1;
%依据取值范围，等距取值
 for i=0:10
     x1= i*0.045+0.05; %生成自变量Co负载量的值
     for j=0:10
         x2 =j*0.15+0.5;%生成自变量装料比
         for k=0:10
             x3 = k*0.18 +0.3;%生成自变量乙醇浓度
             for n=0:10
                 x4= n*20+250;%生成自变量温度
                 for m=0:1
                     x5=m;%生成进料方式
                     anss = 20811.6695*x1^2+9.2175139 *x2^2 -3.435380*x3^2-0.060116*x4^2-46.94546 *x5^2-884.32 *x1*x2-2860.43 *x1*x3+64.36 *x1*x4+1523.12 *x1*x5+69.25 *x1*x3-1.65 *x2*x4-39.63 *x2*x5+2.26 *x3*x4+69.80 *x3*x5-3.38 *x4*x5-10201.4373 *x1+261.6080 *x2-260.8979*x3+18.5727 *x4+543.2040 *x5-1559.64869;  % 如果满足条件就计算函数值
                     anss =-anss;
                     if(anss>0)
                         x(num,:)=[num,x1,x2,x3,x4,x5];
                         result(num,:)=anss;
                         num=num+1;
                     end
                 end
                 
             end
             
         end
         
     end
     
 end
 %将结果保存在表格中
x(:,7)=result;
